jcubuntu/arduino-nanobit/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.chip=Chip
menu.softdevice=Softdevice
menu.version=Version
menu.lfclk=Low Frequency Clock
menu.board_variant=Board Variant

# INEX Nanobit
###################
Nanobit.name=Nanobit

Nanobit.vid.0=0x0d28
Nanobit.pid.0=0x0204

Nanobit.upload.tool=sandeepmistry:openocd
Nanobit.upload.protocol=cmsis-dap
Nanobit.upload.target=nrf51
Nanobit.upload.maximum_size=262144
Nanobit.upload.setup_command=transport select swd;
Nanobit.upload.use_1200bps_touch=false
Nanobit.upload.wait_for_upload_port=false
Nanobit.upload.native_usb=false

Nanobit.bootloader.tool=sandeepmistry:openocd

Nanobit.build.mcu=cortex-m0
Nanobit.build.f_cpu=16000000
Nanobit.build.board=Nanobit
Nanobit.build.core=nRF5
Nanobit.build.variant=Nanobit
Nanobit.build.variant_system_lib=
Nanobit.build.extra_flags=-DNRF51
Nanobit.build.float_flags=
Nanobit.build.ldscript=nrf51_xxaa.ld

Nanobit.build.lfclk_flags=-DUSE_LFRC

Nanobit.menu.softdevice.none=None
Nanobit.menu.softdevice.none.softdevice=none
Nanobit.menu.softdevice.none.softdeviceversion=

Nanobit.menu.softdevice.s110=S110
Nanobit.menu.softdevice.s110.softdevice=s110
Nanobit.menu.softdevice.s110.softdeviceversion=8.0.0
Nanobit.menu.softdevice.s110.upload.maximum_size=151552
Nanobit.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
Nanobit.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

Nanobit.menu.softdevice.s130=S130
Nanobit.menu.softdevice.s130.softdevice=s130
Nanobit.menu.softdevice.s130.softdeviceversion=2.0.1
Nanobit.menu.softdevice.s130.upload.maximum_size=151552
Nanobit.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
Nanobit.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld



# BBC MICROBIT
###################

BBCmicrobitV2.name=BBC micro:bit V2

BBCmicrobitV2.vid.0=0x0d28
BBCmicrobitV2.pid.0=0x0204

BBCmicrobitV2.upload.tool=sandeepmistry:openocd
BBCmicrobitV2.upload.protocol=cmsis-dap
BBCmicrobitV2.upload.target=nrf52
BBCmicrobitV2.upload.maximum_size=524288
BBCmicrobitV2.upload.setup_command=transport select swd;
BBCmicrobitV2.upload.use_1200bps_touch=false
BBCmicrobitV2.upload.wait_for_upload_port=false
BBCmicrobitV2.upload.native_usb=false

BBCmicrobitV2.bootloader.tool=sandeepmistry:openocd

BBCmicrobitV2.build.mcu=cortex-m4
BBCmicrobitV2.build.f_cpu=64000000
BBCmicrobitV2.build.board=BBC_MICROBIT_V2
BBCmicrobitV2.build.core=nRF5
BBCmicrobitV2.build.variant=BBCmicrobitV2
BBCmicrobitV2.build.variant_system_lib=
BBCmicrobitV2.build.extra_flags=-DNRF52833_XXAA
BBCmicrobitV2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BBCmicrobitV2.build.ldscript=nrf52833_xxaa.ld

BBCmicrobitV2.build.lfclk_flags=-DUSE_LFSYNT

BBCmicrobitV2.menu.softdevice.none=None
BBCmicrobitV2.menu.softdevice.none.softdevice=none
BBCmicrobitV2.menu.softdevice.none.softdeviceversion=

BBCmicrobit.name=BBC micro:bit

BBCmicrobit.vid.0=0x0d28
BBCmicrobit.pid.0=0x0204

BBCmicrobit.upload.tool=sandeepmistry:openocd
BBCmicrobit.upload.protocol=cmsis-dap
BBCmicrobit.upload.target=nrf51
BBCmicrobit.upload.maximum_size=262144
BBCmicrobit.upload.setup_command=transport select swd;
BBCmicrobit.upload.use_1200bps_touch=false
BBCmicrobit.upload.wait_for_upload_port=false
BBCmicrobit.upload.native_usb=false

BBCmicrobit.bootloader.tool=sandeepmistry:openocd

BBCmicrobit.build.mcu=cortex-m0
BBCmicrobit.build.f_cpu=16000000
BBCmicrobit.build.board=BBC_MICROBIT
BBCmicrobit.build.core=nRF5
BBCmicrobit.build.variant=BBCmicrobit
BBCmicrobit.build.variant_system_lib=
BBCmicrobit.build.extra_flags=-DNRF51
BBCmicrobit.build.float_flags=
BBCmicrobit.build.ldscript=nrf51_xxaa.ld

BBCmicrobit.build.lfclk_flags=-DUSE_LFRC

BBCmicrobit.menu.softdevice.none=None
BBCmicrobit.menu.softdevice.none.softdevice=none
BBCmicrobit.menu.softdevice.none.softdeviceversion=

BBCmicrobit.menu.softdevice.s110=S110
BBCmicrobit.menu.softdevice.s110.softdevice=s110
BBCmicrobit.menu.softdevice.s110.softdeviceversion=8.0.0
BBCmicrobit.menu.softdevice.s110.upload.maximum_size=151552
BBCmicrobit.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
BBCmicrobit.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

BBCmicrobit.menu.softdevice.s130=S130
BBCmicrobit.menu.softdevice.s130.softdevice=s130
BBCmicrobit.menu.softdevice.s130.softdeviceversion=2.0.1
BBCmicrobit.menu.softdevice.s130.upload.maximum_size=151552
BBCmicrobit.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
BBCmicrobit.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld